Revit 2026 API

# ConnectorDuctSystemType Property

---

The duct system type of the connector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public DuctSystemType DuctSystemType { get; }
```
```vb
Public ReadOnly Property DuctSystemType As DuctSystemType
	Get
```
```cpp
public:
property DuctSystemType DuctSystemType {
	DuctSystemType get ();
}
```
```fsharp
member DuctSystemType : DuctSystemType with get
```

#### Property Value

DuctSystemType

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the connector's domain is not DomainHvac. |
| InvalidOperationException | Thrown on failure to get duct system type. |

This is the instantaneous system type at this connector, calculated according to system. For unconnected connectors, the system type is undefined.

#### Reference

Connector Class

Autodesk.Revit.DB Namespace